#include <iostream>
#include <cstdlib>
using namespace std;
int main()
{
    int min = 0, max = 1;
    int a[6];
    cout << "Введіть число" << endl;
    for (int i = 0; i < 6; i++)
    {
        cin >> a[i];
        if (a[i] < min || a[i] > max)
        {
            cout << "Введіть число з діапазону 0-1" << endl;
            cin >> a[i];
        }
    }
    cout << endl;
    cout << endl;
    int b[5][5];
    cout << "Перша частина (кон'юнкція та диз'юнкція): " << endl;
    for (int i = 0; i < 5; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            b[i][j] = 0;
        }
    }
    b[4][0] = a[0] | a[1];
    b[4][1] = b[4][0] | a[2];
    b[4][2] = b[4][1] | a[3];
    b[4][3] = b[4][2] | a[4];
    b[4][4] = b[4][3] | a[5];
    b[3][1] = (a[0] && a[1]) || (b[4][0] && a[2]);
    b[3][2] = b[3][1] | (b[4][1] & a[3]);
    b[3][3] = b[3][2] | (b[4][2] & a[4]);
    b[3][4] = b[3][3] | (b[4][3] & a[5]);
    b[2][2] = (a[0] && a[1]) && (b[4][0] && a[2]) || (b[3][1] && (b[4][1] &&
                                                                  a[3]));
    b[2][3] = b[2][2] | ((b[3][2] & (b[4][2] & a[4])));
    b[2][4] = b[2][3] | (b[3][3] & (b[4][3] & a[5]));
    b[1][3] = ((a[0] && a[1]) && (b[4][0] && a[2]) && ((b[4][1] && a[3]))) ||
              ((b[4][2] && a[4]) && b[3][2]);
    b[1][4] = b[1][3] | (b[2][3] & (b[3][3] & (b[4][3] & a[5])));
    b[0][4] = ((a[0] && a[1]) && (b[4][0] && a[2]) && (b[4][1] && a[3]) &&
               (b[4][2] && a[4])) ||
              (b[4][3] && a[5] && b[3][3] && b[2][3] && b[1][3]);
    for (int i = 0; i < 5; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            cout << b[i][j] << " ";

            
        }
        cout << endl;
    }
    cout << endl;
    cout << "Друга частина (додавання за модулем 2): " << endl;
    int p[6];
    p[0] = b[4][4] ^ b[3][4];
    p[1] = b[3][4] ^ b[2][4];
    p[2] = b[2][4] ^ b[1][4];
    p[3] = b[1][4] ^ b[0][4];
    p[4] = b[0][4] ^ ((a[0] && a[1]) && (b[4][0] && a[2]) && (b[4][1] && a[3]) &&
                      (b[4][2] && a[4])) |
           (b[4][3] & a[5] & b[3][3] & b[2][3] & b[1][3]);
    p[5] = 0 ^ ((a[0] && a[1]) && (b[4][0] && a[2]) && (b[4][1] && a[3]) &&
                (b[4][2] && a[4])) |
           (b[4][3] & a[5] & b[3][3] & b[2][3] & b[1][3]);
    for (int i = 0; i < 6; i++)
    {
        cout << p[i];
    }
    cout << endl;
    cout << endl;
    cout << "Частина третя(диз'юнкція): " << endl;
    cout << "Відповідь: " << endl;
    int s[3];
    s[0] = p[0] | p[2] | p[4];
    s[1] = p[1] | p[2] | p[5];
    s[2] = p[3] | p[4] | p[5];
    for (int i = 0; i < 3; i++)
    {
        cout << s[i];
    }
    system("pause > null");
    return 0;
}